//
//  ViewController.swift
//  choose-menu-remake
//
//  Created by 小川慧 on 2022/06/27.
//

import UIKit
import WebKit

class ViewController: UIViewController, UITabBarDelegate, WKNavigationDelegate, UISearchBarDelegate {
    //アウトレットの宣言
    @IBOutlet weak var logo: UIImageView!
    @IBOutlet weak var webview: WKWebView!
    //グローバル変数・配列

    let products_name = ["SA06": "チキンのシーザーサラダ", "SA02": "小エビのサラダ", "SA04": "ガーデンサラダ", "SA12": "オリーブアンチョビのガーデンサラダ", "SU01": "コーンクリームスープ", "SU03": "冷たいパンプキンスープ", "RP08": "ミニフィセル", "RP09": "ガーリックトースト", "RP06": "プチフォッカ", "RP05": "セットプチフォッカ", "RP04": "シナモンプチフォッカ", "AA13": "爽やかニンジンサラダ", "AA20": "バッファローモッツァレラ", "AA16": "プロシュート", "AA09": "アスパラガスの温サラダ", "AA25": "柔らか青豆とペコリーノチーズの温サラダ", "AA19": "ブロッコリーのくたくた", "AA15": "カリッとポテト", "AA04": "ポップコーンシュリンプ", "AA07": "チョリソー", "AA26": "イタリア風もつ煮込み", "AA05": "エスカルゴのオーブン焼き", "AA01": "辛味チキン", "AA02": "アロスティチーニ", "AA10": "ムール貝のガーリック焼き", "AA18": "煉獄のたまご", "MT05": "サルシッチャのグリル", "MT18": "レフォールソースのハンバーグとサルシッチャの盛り合わせ", "DG07": "エビクリームグラタン", "PZ01": "マルゲリータピザ", "PZ02": "バッファローモッツァレラのピザ", "PZ03": "パンチェッタのピザ", "PZ06": "たっぷりコーンのピザ", "PZ07": "オリーブアンチョビのマルゲリータピザ", "PZ08": "ソーセージピザ", "PA01": "タラコソースシシリー風", "PA02": "ミートソースのボロニア風", "PA12": "半熟卵のミートソースボロニア風", "PA04": "パルマ風スパゲッティ", "PA03": "ペペロンチーノ", "PA17": "半熟卵のペペロンチーノ", "PA25": "ペンネアラビアータ", "PA19": "スパゲッティアラビアータ", "PA08": "アーリオ・オーリオ", "PA13": "ラムのラグーソース(ペンネ)", "PA15": "ラムのラグーソース(スパゲッティ)", "PA11": "イカの墨入りスパゲッティ", "PA05": "カルボナーラ", "PA06": "エビとブロッコリーのオーロラソース", "PA26": "野菜と白インゲン豆の煮込み", "PA27": "もつ入り野菜と白インゲン豆の煮込み", "TP01": "トッピング半熟卵", "DG01": "ミラノ風ドリア", "DG02": "チーズたっぷりミラノ風ドリア", "DG03": "半熟卵のミラノ風ドリア", "DG05": "セットプチフォッカ付きミラノ風ドリア", "MT07": "ディアボラ風ハンバーグ", "MT01": "ハンバーグステーキ", "MT03": "イタリアンハンバーグ", "MT06": "ポップコーンシュリンプとハンバーグの盛り合わせ", "MT15": "チョリソーとハンバーグの盛り合わせ", "RP01": "ライス", "MT02": "若鶏のディアボラ風", "MT09": "リブステーキ", "DE17": "フレンチトースト", "DE11": "すっきりレモンのシャーベット", "DE07": "チョコレートケーキ", "DE06": "イタリアンプリン"]
    let product_cal = ["SA06": "チキンのシーザーサラダ", "SA02": "小エビのサラダ", "SA04": "ガーデンサラダ", "SA12": "オリーブアンチョビのガーデンサラダ", "SU01": "コーンクリームスープ", "SU03": "冷たいパンプキンスープ", "RP08": "ミニフィセル", "RP09": "ガーリックトースト", "RP06": "プチフォッカ", "RP05": "セットプチフォッカ", "RP04": "シナモンプチフォッカ", "AA13": "爽やかニンジンサラダ", "AA20": "バッファローモッツァレラ", "AA16": "プロシュート", "AA09": "アスパラガスの温サラダ", "AA25": "柔らか青豆とペコリーノチーズの温サラダ", "AA19": "ブロッコリーのくたくた", "AA15": "カリッとポテト", "AA04": "ポップコーンシュリンプ", "AA07": "チョリソー", "AA26": "イタリア風もつ煮込み", "AA05": "エスカルゴのオーブン焼き", "AA01": "辛味チキン", "AA02": "アロスティチーニ", "AA10": "ムール貝のガーリック焼き", "AA18": "煉獄のたまご", "MT05": "サルシッチャのグリル", "MT18": "レフォールソースのハンバーグとサルシッチャの盛り合わせ", "DG07": "エビクリームグラタン", "PZ01": "マルゲリータピザ", "PZ02": "バッファローモッツァレラのピザ", "PZ03": "パンチェッタのピザ", "PZ06": "たっぷりコーンのピザ", "PZ07": "オリーブアンチョビのマルゲリータピザ", "PZ08": "ソーセージピザ", "PA01": "タラコソースシシリー風", "PA02": "ミートソースのボロニア風", "PA12": "半熟卵のミートソースボロニア風", "PA04": "パルマ風スパゲッティ", "PA03": "ペペロンチーノ", "PA17": "半熟卵のペペロンチーノ", "PA25": "ペンネアラビアータ", "PA19": "スパゲッティアラビアータ", "PA08": "アーリオ・オーリオ", "PA13": "ラムのラグーソース(ペンネ)", "PA15": "ラムのラグーソース(スパゲッティ)", "PA11": "イカの墨入りスパゲッティ", "PA05": "カルボナーラ", "PA06": "エビとブロッコリーのオーロラソース", "PA26": "野菜と白インゲン豆の煮込み", "PA27": "もつ入り野菜と白インゲン豆の煮込み", "TP01": "トッピング半熟卵", "DG01": "ミラノ風ドリア", "DG02": "チーズたっぷりミラノ風ドリア", "DG03": "半熟卵のミラノ風ドリア", "DG05": "セットプチフォッカ付きミラノ風ドリア", "MT07": "ディアボラ風ハンバーグ", "MT01": "ハンバーグステーキ", "MT03": "イタリアンハンバーグ", "MT06": "ポップコーンシュリンプとハンバーグの盛り合わせ", "MT15": "チョリソーとハンバーグの盛り合わせ", "RP01": "ライス", "MT02": "若鶏のディアボラ風", "MT09": "リブステーキ", "DE17": "フレンチトースト", "DE11": "すっきりレモンのシャーベット", "DE07": "チョコレートケーキ", "DE06": "イタリアンプリン"]

    override func viewDidLoad() {
        super.viewDidLoad()
        //ロゴ表示
        logo.image = UIImage(named: "logo")
        //初期設定としてindex.htmlを表示
        let url = URL(string: "file:///Users/ogawasatoshi/Desktop/3%E5%B9%B4%E7%94%9F/IP3S/choose-menu-remake/choose-menu-remake/index.html")
        let request = URLRequest(url:url!)
        webview.load(request)
    }

    //「クリック」ボタンクリック
    @IBAction func btn(_ sender: Any) {
        var price: Int = 0
        var items: [Int] = []
        var names: [String] = []
        var products = ["SA06": 350, "SA02": 350, "SA04": 350, "SA12": 450, "SU01": 150, "SU03": 150, "RP08": 150, "RP09": 200, "RP06": 150, "RP05": 100, "RP04": 200, "AA13": 200, "AA20": 300, "AA16": 400, "AA09": 300, "AA25": 200, "AA19": 250, "AA15": 250, "AA04": 300, "AA07": 400, "AA26": 350, "AA05": 400, "AA01": 300, "AA02": 400, "AA10": 400, "AA18": 300, "MT05": 450, "MT18": 600, "DG07": 400, "PZ01": 400, "PZ02": 500, "PZ03": 400, "PZ06": 400, "PZ07": 500, "PZ08": 400, "PA01": 400, "PA02": 400, "PA12": 450, "PA04": 400, "PA03": 300, "PA17": 350, "PA25": 400, "PA19": 400, "PA08": 300, "PA13": 600, "PA15": 600, "PA11": 500, "PA05": 500, "PA06": 500, "PA26": 450, "PA27":600, "TP01": 50, "DG01": 300, "DG02": 300, "DG03": 350, "DG05": 400, "MT07": 500, "MT01": 400, "MT03": 500, "MT06": 600, "MT15": 550, "RP01": 150, "MT02": 500, "MT09":1000, "DE17":400, "DE11": 200, "DE07": 300, "DE06": 250]
        
        //配列計算をソートする
            //判定式(残高が50以上)
            //↓
            //残高以下の商品を１つ選択
            //↓
            //配列に入れる
            //↓
            //減算
        while(price < 1000) {
//            var newProducts: [String:Int] = ["":0]
//            products.forEach {
//                if $0.value < 1000 - price {
//                    print($0.value)
//                    newProducts.append($0)
//                }
//            }
//            products = newProducts
            let new_products = products.filter{key, value in
                return value <= (1000 - price)
            }
            products  = new_products
            
            let one = products.randomElement()
//            print(one!.value)
//            print("-----------------------------------------")
            let CODE = one!.key
            let MONEY = one!.value
            items += [MONEY]
            names += [products_name[CODE]!]
            price = price + MONEY
            price = price + 100
//            print(products)
//            print("-------------------------------")
        }
        print("-----------------------------------------")
        print(items)
        print("-----------------------------------------")
        print(names)
//        print(products)
        
        //return
//        let id = "";
//        let name = "";
//        let price = "";
//        webview.evaluateJavaScript("appendItem('" + id + "," + name + "," + price + "');", completionHandler: { _,_ in})
    }
}

